#region FileInfo
/**
*┌──────────────────────────────────────────────────────────────┐
*│　类    名：      	Enums   
*│  项    目：     	ArcFaceSharp.ArcFace                                                 
*│　作	   者：       	tanghx                                           
*│　创建时间：        	2018/11/6 17:18:59                                          
*│　描	   述：                           
*└──────────────────────────────────────────────────────────────┘
*/
#endregion

using System.ComponentModel;

namespace ArcFaceSharp.ArcFace
{

        /// <summary>
        /// 检测方向的优先级
        /// </summary>
        public enum DetectionOrientPriority
        {
            ASF_OP_0_ONLY = 0x1,    //仅检测0度
            ASF_OP_90_ONLY = 0x2,   //仅检测90度
            ASF_OP_270_ONLY = 0x3,  //仅检测270度
            ASF_OP_180_ONLY = 0x4,  //仅检测180度
            ASF_OP_0_HIGHER_EXT = 0x5, //检测0、90、270、180全角度
        }

        /// <summary>
        /// 检测到的人脸角度
        /// </summary>
        public enum DetectedOrientCode
        {
            ASF_OC_0 = 0x1,     //0度
            ASF_OC_90 = 0x2,     //90度
            ASF_OC_270 = 0x3,     //270度
            ASF_OC_180 = 0x4,     //180度
            ASF_OC_30 = 0x5,     //30度
            ASF_OC_60 = 0x6,     //60度
            ASF_OC_120 = 0x7,     //120度
            ASF_OC_150 = 0x8,     //150度
            ASF_OC_210 = 0x9,     //210度
            ASF_OC_240 = 0xa,     //240度
            ASF_OC_300 = 0xb,     //300度
            ASF_OC_330 = 0xc,     //330度
        }

        /// <summary>
        /// 结果代码
        /// </summary>
        public enum ResultCode
        {
            成功 = 0,
            错误原因不明 = 1,
            无效的参数 = 2,
            引擎不支持 = 3,
            内存不足 = 4,
            状态错误 = 5,
            用户取消相关操作 = 6,
            操作时间过期 = 7,
            用户暂停操作 = 8,
            缓冲上溢 = 9,
            缓冲下溢 = 10,
            存贮空间不足 = 11,
            组件不存在 = 12,
            全局数据不存在 = 13,
            无效的AppId = 28673,
            无效的SDKKey = 28674,
            AppId和SDKKey不匹配 = 28675,
            SDKKey和使用的SDK不匹配 = 28676,
            系统版本不被当前SDK所支持 = 28677,
            SDK有效期过期_需要重新下载更新 = 28678,
            无效的输入内存 = 73729,
            无效的输入图像参数 = 73730,
            无效的脸部信息1 = 73731,
            当前设备无GPU可用 = 73732,
            待比较的两个人脸特征的版本不一致 = 73733,
            人脸特征检测错误未知 = 81921,
            人脸特征检测内存错误 = 81922,
            人脸特征检测格式错误 = 81923,
            人脸特征检测参数错误 = 81924,
            人脸特征检测结果置信度低 = 81925,
            Engine不支持的检测属性 = 86017,
            需要检测的属性未初始化 = 86018,
            待获取的属性未在process中处理过 = 86019,
            PROCESS不支持的检测属性 = 86020,
            无效的输入图像 = 86021,
            无效的脸部信息2 = 86022,
            SDK激活失败_请打开读写权限 = 90113,
            SDK已激活 = 90114,
            SDK未激活 = 90115,
            detectFaceScaleVal不支持 = 90116,
            SDK版本不匹配 = 90117,
            设备不匹配 = 90118,
            唯一标识不匹配 = 90119,
            参数为空 = 90120,
            活体检测功能已过期 = 90121,
            版本不支持 = 90122,
            签名错误 = 90123,
            数据库插入错误 = 90124,
            唯一标识符校验失败 = 90125,
            颜色空间不支持 = 90126,
            图片宽度或高度不支持 = 90127,
            READ_PHONE_STATE权限被拒绝 = 90128,
            激活数据被破坏, 请删除激活文件_重新进行激活 = 90129,
            无法解析主机地址 = 94209,
            无法连接服务器 = 94210,
            网络连接超时 = 94211,
            网络未知错误 = 94212,
            无法连接激活码服务器 = 98305,
            服务器系统错误 = 98306,
            请求参数错误 = 98307,
            激活码正确_且未被使用_但和传入的APPID及APPKEY不匹配 = 98308,
            传入的KEY值虽然正确_但此KEY已经被激活 = 98309,
            KEY格式不对_一般来说是KEY错误或者未传入KEY值 = 98310

        }


        /// <summary>
        /// 引擎的工作模式
        /// </summary>
        public enum EngineMode
        {
            人脸检测 = 0x00000001,
            人脸识别 = 0x00000004,
            年龄识别 = 0x00000008,
            性别识别 = 0x00000010,
            角度识别 = 0x00000020
        }

}
